import colorama

attributes = dir(colorama)
print(attributes)
'''
colorama використовується для додавання кольорів і стилів до тексту в терміналі

colorama.init()
Ініціалізує бібліотеку.

colorama.Fore

Використовується для зміни кольору тексту на передньому плані.
Основні кольори:
Fore.RED
Fore.GREEN
Fore.YELLOW
Fore.BLUE
Fore.RESET (скидання кольору до стандартного).

colorama.Back

Відповідає за зміну кольору фону.
Основні кольори аналогічні до Fore.

colorama.Style

Встановлює стиль тексту, наприклад:
Style.DIM – текст блідий.
Style.NORMAL – стандартний стиль.
Style.BRIGHT – яскравий текст.

colorama.deinit()

Відключає вплив colorama

colorama.ansi

Містить розширені функції для управління кольорами ANSI в терміналі.

cursor
Модуль cursor у colorama відповідає за управління положенням текстового курсора в терміналі. 
Його функції дозволяють пересувати курсор або приховувати/показувати його. Це корисно для створення інтерактивних консолей.

ansitowin32
Модуль ansitowin32 це адаптер, який забезпечує сумісність ANSI-кодів кольорів з Windows-консолю. 
Справа в тому, що консоль виндовс не підтримує кольори за замовчуванням, і цей модуль переводить ANSI-коди в формат, зрозумілий для Windows.

'''
